Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.WallELASeperationOverlap
A wall and a load area separation line overlap. One of them may be ignored when Revit finds load area boundaries.
Shorten or delete the load area separation line to remove the overlap.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.ELASeparationLinesOverlap
Highlighted load area separation lines overlap. One of them may be ignored when Revit finds load area boundaries. Delete one of the lines.